tutorials/incompressible/adjointOptimisationFoam/sensitivityMaps/motorBike/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
    grad(nuTilda)   cellLimited Gauss linear 1;
    gradDConv       cellLimited Gauss linear 1;
    gradDaConv      cellLimited Gauss linear 1;
    gradUATC        cellLimited Gauss linear 1;
}

divSchemes
{
    default                 Gauss linear;
    div(phi,U)              bounded Gauss linearUpwindV grad(U);
    div(phi,nuTilda)        bounded Gauss upwind;
    div(yPhi,yWall)                 Gauss linearUpwind gradDConv;

    div(-phiMean,Ua)        bounded Gauss upwind;
    div(-phiMean,nuaTilda)  bounded Gauss upwind;
    div(-yPhi,da)                   Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear limited 0.333;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.333;
}

wallDist
{
    method advectionDiffusion;
    advectionDiffusionCoeffs
    {
        method    meshWave;
        tolerance 1.e-5;
        maxIter   1000;
        epsilon   0.1;
    }
}


// ************************************************************************* //
